{
    "pageTitle": "Case Study In-Detail - Knight’s Academy",
    "pageDescription": " Revolutionising the Way Young Athletes Connect with Scouts and Coaches: Knight’s Academy Cutting Edge Web Platform Redefines Opportunities in American Football and Beyond",
    "CaseStudyBannerData": {
        "StudyBannerModalImg": "/images/case-study-banner-modal-image-6.jpg",
        "BannerTitle": "Knight's Academy",
        "BannerDesc": "Knights Academy’s Transformation: A feat of strategic web design and digital marketing prowess, connecting talents with opportunities from across continents, crafted with meticulous, precision and care."
    },
    "ProjectOverviewData":{
            "projectOverviewSubtitle": "Project Overview",
            "projectOverviewBeforeColorTitle": "Revolutionising the Way Young Athletes Connect with Scouts and Coaches: Knight’s Academy Cutting Edge Web Platform Redefines Opportunities in American Football and Beyond",
            "projectOverviewDesc": "",
            "quoteDescText": "Our journey with Knight’s Academy started with a deep dive into its mission and history. Through extensive research and meaningful conversations, we unearthed the unique qualities that drive this platform’s commitment to connecting talent with professional opportunities in American Football.",
            "overviewPortfolioTitle": "Web Design",
            "overviewPortfolioImage": "/images/case-study-modal-image-6.jpg"
    },
    "ProjectChallengeData": {
        "projectChallengeModalTitle": "The Challenge",
        "projectChallengeTitle": "The Challenge",
        "projectChallengeQuoteText": "The Challenge Lay in creating a functionally seamless platform for young athletes to showcase their talents while bridging them to professional opportunities in American Football through scouts and coaches, and potentially in other sports across Europe.",
        "projectChallengeQuoteDesc": "The Primary objectives were to boost athlete engagement, refine user interactions, and optimise the scouting process for seamless athlete-scout connections.",
        "projectChallengeAssetsTitle1": "Logo Design",
        "projectChallengeAssetsImage1": "/images/case-study-6-brand-assets-1.jpg",
        "projectChallengeAssetsTitle2": "Brand Identity",
        "projectChallengeAssetsImage2": "/images/case-study-6-brand-assets-2.jpg"
    },
    "ProjectMethodeData":{
        "sectionModelTitle": "THE METHOD",
        "sectionTitle": "The Particular Method",
        "methodDescriptions": [
            "Our approach focused on creating a dynamic platform that empowers young athletes to showcase their skills while providing scouts and coaches with a user friendly interface for efficient talent discovery and recruitment.",
            "We developed a sophisticated profile system. Each athlete has the ability to create a comprehensive profile showcasing the skills, achievements and aspirations, Meanwhile, scouts and coaches can refine their searches based on specific criteria such as position, skills, and performance metrics. This method ensures that athletes are effectively matched with the right opportunity, streamlining the recruitment process for all parties involved. Recognising the need for an engaging and visually appealing platform, we integrated a dynamic multimedia elements. Athletes can easily upload their content, showcasing their abilities in a visually appealing manner. The platforms vibrant and interactive design not only captures attention but also enhances user engagement, creating a positive impression for both parties.",
            "To facilitate commitment and trust among participants, we implemented a secure payment system, Athletes are required to agree to the terms and conditions and make an annual subscription payment. Additionally, to maintain the integrity of the statistics, we introduced a verification process by coaches. This ensure that all data points presented on the platform is accurate and reliable, building credibility for both athletes and scouts. By combing a secure payment system with verified performance metrics, we’ve established a foundation of trust wihtin the Knight’s Academy Community."
        ],
        
        "callImage": "/images/schedule-call-image.svg"
    },
    "ProjectResultData": {
        "sectionModelTitle": "The result",
        "sectionTitle": "The result",
        "resultImage": "/images/case-study-result-img-6.jpg",
        "results": [
            {
                "percent": "40%",
                "description": "Increase in average session duration, demonstrating improved engagement"
            },
            {
                "percent": "32%",
                "description": "Higher organic traffic within 6 months"
            },
            {
                "percent": "20%",
                "description": "reduction in KASP’s cost per acquisition"
            }
        ],
        "resultSecBgClass": "bg-varient-color-3"
    },
    "featuredPostData":{
        "featuredSecTitle": "Case Studies",
        "posts": [
            {
                "image": "/images/featured-case-study-img-1.png",
                "title": "Hult Ib School",
                "subtitle": "web design and Brand Assets",
                "link": "/case-studies/hult-ib-school"
            },
            {
                "image": "/images/featured-case-study-img-2.png",
                "title": "ZENBASE",
                "subtitle": "web design and Brand Assets",
                "link": "/case-studies/zenbase"
            },
            {
                "image": "/images/featured-case-study-img-3.png",
                "title": "KNIGHT’S ACADEMY",
                "subtitle": "web design and Brand Assets",
                "link": "/case-studies/knights-academy"
            }
        ]
    }
}